In [123]:
import pandas as pd

In [124]:
inspections_path = '/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 6 Text data processing/Data/chicago_food_inspections.csv'

In [125]:
df_inspections = pd.read_csv(inspections_path)

In [126]:
df_inspections.shape

(153810, 2)

In [127]:
df_inspections.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  object
dtypes: object(2)
memory usage: 2.3+ MB

In [128]:
df_inspections.nunique()

Name    92553
Risk        4
dtype: int64

In [129]:
df_inspections['Risk'] = df_inspections['Risk'].astype('category')

In [130]:
df_inspections.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  category
dtypes: category(1), object(1)
memory usage: 1.3+ MB

In [131]:
df_inspections.head()

                          Name             Risk
0   MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                  JETS PIZZA   Risk 2 (Medium)
2                   ROOM 1520      Risk 3 (Low)
3    MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                CHARTWELLS       Risk 1 (High)

### Letter Casing and Whitespace

**Check names for extra spaces**

In [132]:
df_inspections['Name'].values

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       ..., ' Cafe 608 ', "  mr.daniel's ", '   TEMPO CAFE '],
      dtype=object)

#### Remove left and right extra spaces

**Check how many spaces we got in the Name column**

In [133]:
df_inspections['Name'].str.contains(r'^\s+|\s+$').sum()

153809

In [134]:
df_inspections['Name'] = df_inspections['Name'].str.lstrip().str.rstrip()

In [135]:
df_inspections['Name'].values

array(['MARRIOT MARQUIS CHICAGO', 'JETS PIZZA', 'ROOM 1520', ...,
       'Cafe 608', "mr.daniel's", 'TEMPO CAFE'], dtype=object)

In [136]:
#check Name column for extra spaces from left an right
df_inspections['Name'].str.contains(r'^\s+|\s+$').sum()

0

**Also we can use df_inspections['Name'].str.strip() - to remove spaces from both sides**

#### Change first letter to uppercase

**str.title() method changes first letter in the each word**

In [137]:
# Change first letter to uppercase
df_inspections['Name'] = df_inspections['Name'].str.title()

In [138]:
df_inspections.head(10)

                        Name             Risk
0    Marriot Marquis Chicago    Risk 1 (High)
1                 Jets Pizza  Risk 2 (Medium)
2                  Room 1520     Risk 3 (Low)
3    Marriot Marquis Chicago    Risk 1 (High)
4                 Chartwells    Risk 1 (High)
5      Shrimp'S Fish Chicken  Risk 2 (Medium)
6            Art'S Drive Inn    Risk 1 (High)
7                    Vincent    Risk 1 (High)
8  Captain Hooks Of Dan Ryan  Risk 2 (Medium)
9           Jibarito'S Y Mas    Risk 1 (High)

### String Slicing

In [139]:
df_inspections["Risk"].head()

0      Risk 1 (High)
1    Risk 2 (Medium)
2       Risk 3 (Low)
3      Risk 1 (High)
4      Risk 1 (High)
Name: Risk, dtype: category
Categories (4, object): ['All', 'Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)']

**Cut the number of symbols from each row in the column Risk**

In [140]:
df_inspections["Risk"].str.slice(5, 6).head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

**Next code returns the same result**

In [141]:
df_inspections["Risk"].str[5:6].head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

#### Retrieve the type of Rysk from each column

In [142]:
df_inspections["Risk"].head()

0      Risk 1 (High)
1    Risk 2 (Medium)
2       Risk 3 (Low)
3      Risk 1 (High)
4      Risk 1 (High)
Name: Risk, dtype: category
Categories (4, object): ['All', 'Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)']

**Example 1**

In [143]:
df_inspections["Risk"].str[8:-1].head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

**Example 2**

In [144]:
df_inspections["Risk"].str.slice(8, -1).head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

**Example 3**

In [145]:
df_inspections["Risk"].str.slice(8).str.rstrip(")").head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

**Example 4**

In [146]:
df_inspections["Risk"].str.slice(8).str.replace(")", "").head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

### Boolean Methods

#### Find a word "pizza" in the Name column

**Set a lower case**

In [147]:
df_inspections['Name'].str.lower().str.contains('pizza').sum()

3993

In [148]:
df_inspections['Name'].str.lower().str.contains('pizza').head()

0    False
1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [149]:
has_pizza=df_inspections['Name'].str.lower().str.contains('pizza')
df_inspections[has_pizza]

                                    Name             Risk
1                             Jets Pizza  Risk 2 (Medium)
19         Nancy'S Home Of Stuffed Pizza    Risk 1 (High)
27            Nary'S Grill & Pizza ,Inc.    Risk 1 (High)
29                   Narys Grill & Pizza    Risk 1 (High)
68                         Colutas Pizza    Risk 1 (High)
...                                  ...              ...
153756       Angelo'S Stuffed Pizza Corp    Risk 1 (High)
153764                Cochiaros Pizza #2    Risk 1 (High)
153772  Fernando'S Mexican Grill & Pizza    Risk 1 (High)
153788            Reggio'S Pizza Express    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3993 rows x 2 columns]

#### Find rows which begin with a Tacos word

In [150]:
df_inspections['Name'].str.lower().str.startswith('tacos').sum()

105

In [151]:
df_inspections['Name'].str.lower().str.startswith('tacos').head()

0    False
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [152]:
starts_with_tacos = df_inspections['Name'].str.lower().str.startswith('tacos')
df_inspections[starts_with_tacos].head()

                     Name           Risk
69           Tacos Nietos  Risk 1 (High)
556   Tacos El Tio 2 Inc.  Risk 1 (High)
675      Tacos Don Gabino  Risk 1 (High)
958   Tacos El Tio 2 Inc.  Risk 1 (High)
1036  Tacos El Tio 2 Inc.  Risk 1 (High)

**Find a Tacos word in the end of lines**

In [153]:
ends_with_tacos = df_inspections['Name'].str.lower().str.endswith('tacos')
df_inspections[ends_with_tacos].head()

              Name           Risk
382   Lazo'S Tacos  Risk 1 (High)
569   Lazo'S Tacos  Risk 1 (High)
2652  Flying Tacos   Risk 3 (Low)
3250  Jony'S Tacos  Risk 1 (High)
3812  Paco'S Tacos  Risk 1 (High)

### Splitting Strings

In [154]:
customers_path = '/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 6 Text data processing/Data/customers.csv'

In [155]:
df_customers = pd.read_csv(customers_path)

In [156]:
df_customers.shape

(9961, 2)

In [157]:
df_customers.nunique()

Name       9297
Address    9961
dtype: int64

In [158]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9961 entries, 0 to 9960
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     9961 non-null   object
 1   Address  9961 non-null   object
dtypes: object(2)
memory usage: 155.8+ KB

#### Get the lentgh

In [159]:
df_customers['Name'].str.len().head()

0    13
1    17
2    15
3    19
4    14
Name: Name, dtype: int64

**Split and count the words**

In [160]:
df_customers['Name'].str.split(' ').head()

0           [Frank, Manning]
1       [Elizabeth, Johnson]
2         [Donald, Stephens]
3    [Michael, Vincent, III]
4          [Jasmine, Zamora]
Name: Name, dtype: object

In [161]:
df_customers['Name'].str.split(' ').str.len().head()

0    2
1    2
2    2
3    3
4    2
Name: Name, dtype: int64

**Resolve the issue with name like Michael Vincent III**

In [162]:
df_customers['Name'].str.split(' ',n=1).head()

0          [Frank, Manning]
1      [Elizabeth, Johnson]
2        [Donald, Stephens]
3    [Michael, Vincent III]
4         [Jasmine, Zamora]
Name: Name, dtype: object

In [163]:
df_customers['Name'].str.split(' ',n=1).str.len().head()

0    2
1    2
2    2
3    2
4    2
Name: Name, dtype: int64

#### Get only names

In [164]:
df_customers['Name'].str.split(' ',n=1).str[0].head()

0        Frank
1    Elizabeth
2       Donald
3      Michael
4      Jasmine
Name: Name, dtype: object

**Get only surnames**

In [165]:
df_customers['Name'].str.split(' ',n=1).str.get(1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

**Using get(-1)**

In [166]:
df_customers['Name'].str.split(' ',n=1).str.get(-1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

**Using Expand parameter to split names and lastnames**

In [167]:
df_customers['Name'].str.split(pat=' ',n=1,expand=True).head()

           0            1
0      Frank      Manning
1  Elizabeth      Johnson
2     Donald     Stephens
3    Michael  Vincent III
4    Jasmine       Zamora

#### Create new columns for name and lastname

In [168]:
df_customers[["First Name", "Last Name"]]= df_customers['Name'].str.split(pat=' ',n=1,expand=True)

In [169]:
df_customers.head()

,Name,Address,First Name,Last Name
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora

**Drop the extra column**

In [176]:
df_customers=df_customers.drop(labels='Name',axis='columns')

**Change order of columns**

In [180]:
df_customers=df_customers[['First Name', 'Last Name','Address']]
df_customers.head()

  First Name    Last Name                                            Address
0      Frank      Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1  Elizabeth      Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2     Donald     Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3    Michael  Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4    Jasmine       Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...